uhnp/src/DataProcessors/тн_ЗагрузкаЗачетовКЦСПортала/тн_ЗагрузкаЗачетовКЦСПортала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_ЗагрузкаЗачетовКЦСПортала</name>
  <comment>//Сафиуллина З.Р. 14.02.2025 Выполнение задач №000052637</comment>
  <tabularSections>
    <name>Зачеты</name>
    <attributes>
      <name>ДатаЗачета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПрочиеДоходыРасходы</name>
      <type>
        <types>DocumentRef.ПрочиеДоходыРасходы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕКК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходовКодКонсолидации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПодразделения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатПроверки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/тн_ЗапросыRabbitMQ/тн_ЗапросыRabbitMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_ЗапросыRabbitMQ</name>
  <comment>//Сафиуллина З.Р. 18.02.2025 Выполнение задач №000052637</comment>
  <resources>
    <name>XML_ПакетИсходящий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>XML_ПакетВходящий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОтправкиЗапроса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветПолучен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.тн_ВидыСообщенийPortal</types>
      <types>EnumRef.тн_ВидыСообщений_ОбменМеждуЦИС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/тн_ВидыИнтеграций/тн_ВидыИнтеграций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>тн_ВидыИнтеграций</name>
  <comment>Выполнение задач №000035594</comment>
  <enumValues>
    <name>API</name>
  </enumValues>
  <enumValues>
    <name>API_Отправка</name>
  </enumValues>
  <enumValues>
    <name>Портал_Отправка</name>
    <comment>БИТ Тараскина М. 08.12.2015 Выполнение задач №000016981</comment>
  </enumValues>
  <enumValues>
    <name>Портал_Получение</name>
    <comment>БИТ Тараскина М. 08.12.2015 Выполнение задач №000016981</comment>
  </enumValues>
  <enumValues>
    <name>Обмены_Отправка</name>
  </enumValues>
  <enumValues>
    <name>International_Отправка</name>
    <comment>Абрамкин П.Ю. (БИТ) 14-07-2016 Выполнение задач 000021147</comment>
  </enumValues>
  <enumValues>
    <name>International_Получение</name>
    <comment>Абрамкин П.Ю. (БИТ) 14-07-2016 Выполнение задач 000021147</comment>
  </enumValues>
  <enumValues>
    <name>Zabbix</name>
    <comment>Соколов А. А. 16.12.2016 Выполнение задач 000023372</comment>
  </enumValues>
  <enumValues>
    <name>file_ws</name>
    <comment>//Кропачев 18.04.2017 ВЗ000024271</comment>
  </enumValues>
  <enumValues>
    <name>Сервис1СКонтрагент</name>
    <comment>// Калинин А. 22.05.2018 Выполнение задач №000028467</comment>
  </enumValues>
  <enumValues>
    <name>Обмены_Получение</name>
  </enumValues>
  <enumValues>
    <name>INFOR</name>
    <comment>Хохлов Владимир 27.08.2018 ВЗ №000029453</comment>
  </enumValues>
  <enumValues>
    <name>EWSServiceWS</name>
    <comment>Хохлов Владимир 2018-08-22 ВЗ №000029405</comment>
  </enumValues>
  <enumValues>
    <name>SQLIServiceWS</name>
    <comment>Хохлов Владимир 2018-08-22 ВЗ №000029405</comment>
  </enumValues>
  <enumValues>
    <name>EBS_WS</name>
    <comment>Хохлов Владимир 2018-08-23 ВЗ №000029405</comment>
  </enumValues>
  <enumValues>
    <name>FileService</name>
    <comment>// Луконин Е.А. 14.01.2020 Выполнение задач №000033749</comment>
  </enumValues>
  <enumValues>
    <name>FileShare</name>
    <comment>// Луконин Е.А. 14.01.2020 Выполнение задач №000033749</comment>
  </enumValues>
  <enumValues>
    <name>ОбменШПД</name>
    <comment>// Калинин А. 09.12.2019 Выполнение задач №000033580</comment>
  </enumValues>
  <enumValues>
    <name>RabbitMQ</name>
    <comment>// Калинин А. 09.12.2019 Выполнение задач №000033580</comment>
  </enumValues>
  <enumValues>
    <name>StockM</name>
    <comment>// Калинин А. 14.01.2020 Выполнение задач №000033888</comment>
  </enumValues>
  <enumValues>
    <name>ERP_УХ_Получение</name>
    <comment>Выполнение задач №000035594</comment>
  </enumValues>
  <enumValues>
    <name>ERP_УХ_Отправка</name>
  </enumValues>
  <enumValues>
    <name>finApp_Отправка</name>
    <comment>№000039664</comment>
  </enumValues>
  <enumValues>
    <name>finApp_Получение</name>
    <comment>№000039664</comment>
  </enumValues>
  <enumValues>
    <name>ОбменМеждуЦИС</name>
    <comment>// Одинец Роман 23.05.2024 Выполнение задач №000048970</comment>
  </enumValues>
  <enumValues>
    <name>TN_EDA</name>
    <comment>// Смирнов Д.А. 16.01.2025 Выполнение задач №000052291</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/тн_ВидыСобытийИнтеграции/тн_ВидыСобытийИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>тн_ВидыСобытийИнтеграции</name>
  <comment>Выполнение задач №000035594</comment>
  <enumValues>
    <name>ПолученПакет</name>
  </enumValues>
  <enumValues>
    <name>ОтправленПакет</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>НачатоФормированиеПакета</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/тн_ВидыСообщенийPortal/тн_ВидыСообщенийPortal.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>тн_ВидыСообщенийPortal</name>
  <comment>№000039663</comment>
  <enumValues>
    <name>advanceReport</name>
  </enumValues>
  <enumValues>
    <name>responseAdvanceReport</name>
  </enumValues>
  <enumValues>
    <name>requestSetOff</name>
    <comment>//Сафиуллина З.Р. 19.02.2025 Выполнение задач №000052637</comment>
  </enumValues>
  <enumValues>
    <name>responseSetOff</name>
    <comment>//Сафиуллина З.Р. 19.02.2025 Выполнение задач №000052637</comment>
  </enumValues>
  <enumValues>
    <name>requestSettlements</name>
    <comment>//Сафиуллина З.Р. 25.02.2025 Выполнение задач №000052637</comment>
  </enumValues>
  <enumValues>
    <name>responseSettlements</name>
    <comment>//Сафиуллина З.Р. 25.02.2025 Выполнение задач №000052637</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/DataProcessors/тн_ЗагрузкаЗачетовКЦСПортала/ManagerModule.bsl
// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
#Область ПрограммныйИнтерфейс  

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Функция ЗагрузитьДанныеСПорталаНаСервере(УникальныйИдентификатор, ПериодЗагрузки = Неопределено, РегламентноеЗадание = Ложь) Экспорт
	
	//Формируем и отправляем сообщение-запрос 
	ПараметрыСообщения = ПараметрыСообщения();
	
	ОбъектXDTO_ЗапросДанных = ПолучитьОбъектXDTO_ЗапросДанных(ПараметрыСообщения);
	ТекстСообщения = СформироватьТекстСообщенияЗапросДанных(ПараметрыСообщения, ОбъектXDTO_ЗапросДанных); 

	Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОтправитьСообщениеЗапрос(ПараметрыСообщения);
	
	ДобавитьЗаписьЗапросыRabbitMQ(ПараметрыСообщения);
		
	ДлительнаяОперация = ДлительнаяОперацияОжиданияОбработкиОтветногоСообщения(ПараметрыСообщения, УникальныйИдентификатор, РегламентноеЗадание);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Процедура СоздатьДокументы(Зачеты, РегламентноеЗадание = Ложь) Экспорт 
	
	НастройкиОтражения = КонстантыПоВзаиморасчетамСКЦ();
	Если Не ЗначениеЗаполнено(НастройкиОтражения) Тогда
		Возврат;
	КонецЕсли;
	
	Для Сч = 0 По Зачеты.Количество() - 1 Цикл 
		
		Стр = Зачеты[Сч];
		
		НеНужноСоздаватьДокумент = ЗначениеЗаполнено(Стр.ДокументПрочиеДоходыРасходы)
			Или ЗначениеЗаполнено(НайтиДокументПрочиеДоходыРасходы(Стр.ID))
			Или Не Стр.РезультатПроверки
			Или Не Стр.Пометка;
			
		Если НеНужноСоздаватьДокумент Тогда	
			Продолжить;
		КонецЕсли; 
		
		Попытка
			Стр.ДокументПрочиеДоходыРасходы = СоздатьДокументПрочиеДоходыРасходы(Стр, НастройкиОтражения);
			//передача ГУИД созданного документа на Портал  
			ПередатьДанныеЗачетаНаПортал(Стр.ID, Строка(Стр.ДокументПрочиеДоходыРасходы.УникальныйИдентификатор()));   
			
			Если РегламентноеЗадание Тогда
				
				ЗаписьЖурналаРегистрации("Фоновое задание. Загрузка зачетов и взаиморасчетов с Портала (тн)",
					УровеньЖурналаРегистрации.Информация,
					Метаданные.РегламентныеЗадания.тн_ЗагрузкаЗачетовВзаиморасчетовСПортала, Стр.ДокументПрочиеДоходыРасходы,
					"Успешно создан и передан на Портал документ ""Отражение прочих доходов и расходов"" (ID " 
					+ Формат(Стр.ID, "ЧГ=0") + ")"); 
			Иначе
				
				ОбщегоНазначения.СообщитьПользователю("Успешно создан и передан на Портал документ ""Отражение прочих доходов и расходов"" (ID " 
					+ Формат(Стр.ID, "ЧГ=0") + ")", Стр.ДокументПрочиеДоходыРасходы);   
								
			КонецЕсли;	
				
		Исключение
			Если ЗначениеЗаполнено(Стр.ДокументПрочиеДоходыРасходы) Тогда
				ДокументОбъект = Стр.ДокументПрочиеДоходыРасходы.ПолучитьОбъект();
				ДокументОбъект.УстановитьПометкуУдаления(Истина);
			КонецЕсли;
			Стр.ДокументПрочиеДоходыРасходы = Неопределено;
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());  
			
			Если РегламентноеЗадание Тогда  
				
				ЗаписьЖурналаРегистрации("Фоновое задание. Загрузка зачетов и взаиморасчетов с Портала (тн)",
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.РегламентныеЗадания.тн_ЗагрузкаЗачетовВзаиморасчетовСПортала, ,
					"Ошибка создания документа ""Отражение прочих доходов и расходов""(ID " 
				    + Формат(Стр.ID, "ЧГ=0")+ "): " + ТекстОшибки); 
				
			Иначе  
				
				ОбщегоНазначения.СообщитьПользователю("Ошибка создания документа ""Отражение прочих доходов и расходов""(ID " 
				  + Формат(Стр.ID, "ЧГ=0")+ "): " + ТекстОшибки);  

			КонецЕсли;	

			Продолжить;
		КонецПопытки;  
		
	КонецЦикла;
		
КонецПроцедуры

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Процедура ЗаполнитьЗачеты(РезультатВыполненияДлительнойОперации, Зачеты, ПериодЗагрузки) Экспорт
	
	СообщениеXDTO = тн_ИнтеграцияFinAppPortal.ПрочитатьСообщениеJSON(РезультатВыполненияДлительнойОперации.Результат);
	Если СообщениеXDTO = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеПоЗачетам = СообщениеXDTO.responseSetOff[0].tableData.string;      

	Для Сч = 1 По ДанныеПоЗачетам.Количество() Цикл
		
		Зачет = ДанныеПоЗачетам[Сч - 1];
		ДатаЗачета = Зачет.date;
		
		Если НЕ тн_ОбщегоНазначения.ДатаВходитВПериод(ДатаЗачета, ПериодЗагрузки.ДатаНачала, ПериодЗагрузки.ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли; 
		
		Стр = Зачеты.Добавить();
		
		Стр.НомерСтроки					  = Сч;
		Стр.ДатаЗачета					  = ДатаЗачета;
		Стр.ID							  = Зачет.id;
		Стр.ЕКК                     	  = Зачет.ekk;
		Стр.ИНН                     	  = СокрЛП(Зачет.inn);
		Стр.КПП                     	  = СокрЛП(Зачет.kpp);
		Стр.Контрагент					  = Справочники.Контрагенты.НайтиКонтрагента(Стр.ЕКК, Стр.ИНН, Стр.КПП);
		Стр.Договор						  = НайтиДоговор(Стр.Контрагент);
		Стр.СтатьяРасходовКодКонсолидации = СокрЛП(Зачет.costItemCode);
		Стр.СтатьяРасходов 				  = НайтиСтатьюРасходов(Стр.СтатьяРасходовКодКонсолидации); 
		Стр.КодПодразделения        	  = СокрЛП(Зачет.departmentCode);
		Стр.Подразделение				  = НайтиПодразделение(Стр.КодПодразделения);
		Стр.Сумма       				  = Зачет.sum;
		Стр.Комментарий					  = СокрЛП(Зачет.comment);  
		Стр.ДокументПрочиеДоходыРасходы   = НайтиДокументПрочиеДоходыРасходы(Зачет.id);
		
	КонецЦикла; 
	
КонецПроцедуры

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Процедура ПроверитьЗаполнениеРеквизитов(Зачеты) Экспорт   
	
	РезультатПроверки = Ложь;

	Для Сч = 0 По Зачеты.Количество() - 1 Цикл
		Стр = Зачеты[Сч];
		
		Если Не Стр.Пометка Тогда
			Продолжить;
		КонецЕсли; 
		
		Результат = Истина;
		Результат = ЗначениеЗаполнено(Стр.ДатаЗачета) И Результат;
		Результат = ЗначениеЗаполнено(Стр.Контрагент) И Результат;
		Результат = ЗначениеЗаполнено(Стр.Договор) И Результат;
		Результат = ЗначениеЗаполнено(Стр.СтатьяРасходов) И Результат;
		Результат = ЗначениеЗаполнено(Стр.Подразделение) И Результат;
		Результат = ЗначениеЗаполнено(Стр.Сумма) И Результат;
		
		Стр.РезультатПроверки 	= Результат;   
		
		 Если Не Результат Тогда
		
				ЗаписьЖурналаРегистрации("Фоновое задание. Загрузка зачетов и взаиморасчетов с Портала (тн)",
					УровеньЖурналаРегистрации.Информация,
					Метаданные.РегламентныеЗадания.тн_ЗагрузкаЗачетовВзаиморасчетовСПортала, ,
					"Для создания документа по ID" + Стр.ID + " недостаточно данных");  
					
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
#КонецОбласти

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
#Область СлужебныеПроцедурыИФункции   

#Область СозданиеДокументов

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Функция КонстантыПоВзаиморасчетамСКЦ()   
	
	КонстантыПоВзаиморасчетамСКЦ = Новый Структура();

	ОрганизацияКЦДляВеденияУУ = Константы.тн_ОрганизацияКЦДляВеденияУУ.Получить(); 
	СтатьяАктивовПассивовКЦ   = Константы.тн_СтатьяАктивовПассивовКЦДляВеденияУУ.Получить();
	
	КонтрольЗаполненияКонстант = ЗначениеЗаполнено(ОрганизацияКЦДляВеденияУУ) + ЗначениеЗаполнено(СтатьяАктивовПассивовКЦ); 
		
	Если КонтрольЗаполненияКонстант < 2 Тогда
		ОбщегоНазначения.СообщитьПользователю("Заполните константы по взаиморасчетам с КЦ."); 
		Возврат КонстантыПоВзаиморасчетамСКЦ;
	КонецЕсли;
	
	КонстантыПоВзаиморасчетамСКЦ.Вставить("ОрганизацияКЦДляВеденияУУ", ОрганизацияКЦДляВеденияУУ);
	КонстантыПоВзаиморасчетамСКЦ.Вставить("СтатьяАктивовПассивовКЦ", СтатьяАктивовПассивовКЦ);
	
	Возврат КонстантыПоВзаиморасчетамСКЦ; 
	
КонецФункции

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Функция СоздатьДокументПрочиеДоходыРасходы(Параметры, НастройкиОтражения) 
	
	//Шапка
	ДокументПДР = Документы.ПрочиеДоходыРасходы.СоздатьДокумент();
	ДокументПДР.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочиеРасходы; 
	ДокументПДР.Организация = НастройкиОтражения.ОрганизацияКЦДляВеденияУУ;
	ДокументПДР.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	ДокументПДР.Основание = "Создано обработкой ""Загрузка зачетов КЦ с Портала"""; 
	ДокументПДР.Ответственный = Пользователи.ТекущийПользователь();
	ДокументПДР.Дата = Параметры.ДатаЗачета;
	ДокументПДР.Комментарий	= Строка(Параметры.Комментарий) + " ID: " + Формат(Параметры.ID, "ЧГ=0");
	ДокументПДР.тн_ИдентификаторЗачетаКЦНаПортале = Параметры.ID;
	
	//ТЧ
	СтрокаТЧ = ДокументПДР.ПрочиеРасходы.Добавить();
	СтрокаТЧ.Подразделение = Параметры.Подразделение;
	СтрокаТЧ.АналитикаРасходов = Параметры.Подразделение;
	СтрокаТЧ.СтатьяРасходов = Параметры.СтатьяРасходов;
	СтрокаТЧ.ДатаОтражения = Параметры.ДатаЗачета; 
	СтрокаТЧ.СтатьяАктивовПассивов = НастройкиОтражения.СтатьяАктивовПассивовКЦ;
	СтрокаТЧ.АналитикаАктивовПассивов = Параметры.Контрагент; 
	СтрокаТЧ.Сумма = Параметры.Сумма; 
	СтрокаТЧ.СуммаБезНДС = Параметры.Сумма;
	СтрокаТЧ.СуммаУпр = Параметры.Сумма;
	СтрокаТЧ.СуммаРегл = 0;
	
	//Настройки счетов учета
	НастройкиСчетовУчета = Новый Соответствие;
	НовыйЭлементНастройкиСчетовУчета = НастройкаСчетовУчетаСлужебныйВызовСервера.СсылкаНовогоЭлементаНастройкиСчетовУчета();
	ДанныеНастройкиСчетовУчета = НастройкаСчетовУчетаКлиентСервер.СоставНастройкиСчетовУчета();
	ДанныеНастройкиСчетовУчета.СчетУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкиОтражения.СтатьяАктивовПассивовКЦ, "СчетУчета");
	ДанныеНастройкиСчетовУчета.Субконто1 = Параметры.Контрагент;
	ДанныеНастройкиСчетовУчета.Субконто2 = Параметры.Договор;  
	НастройкиСчетовУчета.Вставить(НовыйЭлементНастройкиСчетовУчета, ДанныеНастройкиСчетовУчета); 
	ДокументПДР.ДополнительныеСвойства.Вставить("НастройкиСчетовУчета", НастройкиСчетовУчета);
	СтрокаТЧ.НастройкаСчетовУчета = НовыйЭлементНастройкиСчетовУчета;
	
	ДокументПДР.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ДокументПДР.Ссылка;  
	
 КонецФункции
 
// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Процедура ПередатьДанныеЗачетаНаПортал(ИдентификаторЗачета, УИДДокумента) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	//1. Формируем и отправляем сообщение-запрос
	ПараметрыСообщения = ПараметрыСообщения(); 
	
	ОбъектXDTO_ЗапросДанных = ПолучитьОбъектXDTO_ЗапросДанных(ПараметрыСообщения, Истина, ИдентификаторЗачета, УИДДокумента); 
	ТекстСообщения = СформироватьТекстСообщенияЗапросДанных(ПараметрыСообщения, ОбъектXDTO_ЗапросДанных);
	
	ОтправитьСообщениеЗапрос(ПараметрыСообщения);
	
	ДобавитьЗаписьЗапросыRabbitMQ(ПараметрыСообщения);
	
	//2. Ожидаем ответа   в той же транзакции
	РезультатЗапросаДанных = тн_ИнтеграцияFinAppPortal.РезультатЗапросаДанныхСПортала(ПараметрыСообщения);  
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапросаДанных.ЕстьОшибки Тогда
		ВызватьИсключение (РезультатЗапросаДанных.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеТаблицыЗачеты

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Функция НайтиДоговор(Контрагент) 
	
	Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	ВидВзиморасчетовЗачеты = Константы.тн_ВидВзаиморасчетовЗачеты.Получить();
	НаименованиеДоговора = Константы.тн_НаименованиеДоговораДляЗагрузкиДанныхСПортала.Получить();
	
	Если НЕ ЗначениеЗаполнено(Контрагент) 
		ИЛИ НЕ ЗначениеЗаполнено(ВидВзиморасчетовЗачеты) 
		ИЛИ НЕ ЗначениеЗаполнено(НаименованиеДоговора) Тогда
		Возврат Договор;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.тн_ВидВзаиморасчетовЗачеты КАК тн_ВидВзаиморасчетовЗачеты
		|		ПО ДоговорыКонтрагентов.тн_ВидВзаиморасчетов = тн_ВидВзаиморасчетовЗачеты.Значение
		|ГДЕ
		|	ДоговорыКонтрагентов.Контрагент = &Контрагент
		|	И ДоговорыКонтрагентов.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Наименование", НаименованиеДоговора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоДоговоров	= Выборка.Количество();
	
	Если КоличествоДоговоров = 1 Тогда
		Выборка.Следующий();
		Договор = Выборка.Ссылка;
	ИначеЕсли КоличествоДоговоров = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Для контрагента """ + Контрагент + """ не найден договор с видом взаиморасчетов " 
			+ ВидВзиморасчетовЗачеты + " и наименованием " + НаименованиеДоговора + ".");
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Для контрагента """ + Контрагент + """ найдено более одного договора с видом взаиморасчетов """ + ВидВзиморасчетовЗачеты + ".");
	КонецЕсли; 
	
	Возврат Договор; 
	
КонецФункции

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Функция НайтиСтатьюРасходов(КодКонсолидации)
	
	СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
	
	Если НЕ ЗначениеЗаполнено(КодКонсолидации) Тогда
		Возврат СтатьяРасходов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтатьиРасходов.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|ГДЕ
		|	СтатьиРасходов.тн_КодКонсолидации = &тн_КодКонсолидации";
	
	Запрос.УстановитьПараметр("тн_КодКонсолидации", КодКонсолидации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтатьяРасходов = Выборка.Ссылка;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не найдена статья расходов с кодом консолидации " + КодКонсолидации);
	КонецЕсли; 
	
	Возврат СтатьяРасходов;
	
КонецФункции 

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Функция НайтиПодразделение(КодПодразделения) 
	
	Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
	
	Если НЕ ЗначениеЗаполнено(КодПодразделения) Тогда
		Возврат Подразделение;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктураПредприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.тн_КодПодразделенияВКомпании = &КодПодразделения";
	
	Запрос.УстановитьПараметр("КодПодразделения", КодПодразделения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоПодразделений = Выборка.Количество();
	
	Если КоличествоПодразделений = 1 Тогда
		Выборка.Следующий();
		Подразделение = Выборка.Ссылка;
	ИначеЕсли КоличествоПодразделений = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не найдено подразделение с кодом " + КодПодразделения);
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Найдено более одного подразделения с кодом " + КодПодразделения);
	КонецЕсли; 
	
	Возврат Подразделение;
	
КонецФункции

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Функция НайтиДокументПрочиеДоходыРасходы(ИдентификаторЗачета)  
	
	ДокументПрочиеДоходыРасходы = Документы.ПрочиеДоходыРасходы.ПустаяСсылка();
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрочиеДоходыРасходы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПрочиеДоходыРасходы КАК ПрочиеДоходыРасходы
		|ГДЕ
		|	НЕ ПрочиеДоходыРасходы.ПометкаУдаления
		|	И ПрочиеДоходыРасходы.тн_ИдентификаторЗачетаКЦНаПортале = &ИдентификаторЗачета";
	
	Запрос.УстановитьПараметр("ИдентификаторЗачета", ИдентификаторЗачета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДокументПрочиеДоходыРасходы = Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат ДокументПрочиеДоходыРасходы;
	
КонецФункции

#КонецОбласти

#Область ПолучениеДанныхСПортала

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Функция СформироватьТекстСообщенияЗапросДанных(ПараметрыСообщения, ОбъектXDTO_ЗапросДанных)
	
	ИмяТипаЭлементаXDTO	 = "headers";
	ЭлементКонтейнераXDTO = тн_Интеграция.СоздатьКонтейнерXDTO("tn_Integration_Portal", ИмяТипаЭлементаXDTO);
	ОбъектXDTO_ЗапросДанных[ИмяТипаЭлементаXDTO] = ЭлементКонтейнераXDTO;
	
	ПараметрыСообщения.КонтейнерXDTO = ОбъектXDTO_ЗапросДанных;
	тн_Интеграция_УПП.ДобавитьСистемныеПараметры(ПараметрыСообщения);
	
	ТекстСообщения = тн_Интеграция.СериализоватьКонтейнерXDTO(ОбъектXDTO_ЗапросДанных,, "JSON");
	тн_Интеграция_УПП.ЗаменитьПредставлениеФорматов(ТекстСообщения);
	тн_ИнтеграцияFinAppPortal.УдалитьТипизациюВСтрокеJSON(ТекстСообщения);
	
	ПараметрыСообщения.ТекстСообщения = ТекстСообщения;
	
	Возврат ТекстСообщения;
	
КонецФункции

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Функция ПолучитьОбъектXDTO_ЗапросДанных(ПараметрыСообщения, ДокументыСозданы = Ложь, ИдентификаторЗачета = 0, УИДДокумента = "") 
	
	ИдентификаторЗапроса = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыСообщения, "ИдентификаторЗапроса");
	
	ИмяПакетаXDTO = "tn_Integration_Portal";
	ИмяТипаЭлементаXDTO	 = "requestSetOff";
	
	КонтейнерXDTO = тн_Интеграция.СоздатьКонтейнерXDTO(ИмяПакетаXDTO, ИмяТипаЭлементаXDTO);
	
	ЭлементКонтейнераXDTO = тн_Интеграция.СоздатьКонтейнерXDTO(ИмяПакетаXDTO, ИмяТипаЭлементаXDTO + "_DTO"); 
	ЭлементКонтейнераXDTO.date = ТекущаяДатаСеанса();
	ЭлементКонтейнераXDTO.idRequest = ИдентификаторЗапроса;
	ЭлементКонтейнераXDTO.documentsAreCreated = ДокументыСозданы;
	
	Если ДокументыСозданы Тогда
		XDTO_ИмяТЧ = "TableParameters";
		XDTO_ТипТЧ = ФабрикаXDTO.Тип(ИмяПакетаXDTO, ИмяТипаЭлементаXDTO + XDTO_ИмяТЧ);
		XDTO_ТЧ	= ФабрикаXDTO.Создать(XDTO_ТипТЧ);
		XDTO_ТипСтрокаТЧ = ФабрикаXDTO.Тип(ИмяПакетаXDTO, ИмяТипаЭлементаXDTO + XDTO_ИмяТЧ + "String"); 
		XDTO_СтрокаТЧ = ФабрикаXDTO.Создать(XDTO_ТипСтрокаТЧ);
		XDTO_СтрокаТЧ.id = ИдентификаторЗачета;
		XDTO_СтрокаТЧ.documentGuid	= УИДДокумента;
		XDTO_ТЧ.String.Добавить(XDTO_СтрокаТЧ); 
		ЭлементКонтейнераXDTO[XDTO_ИмяТЧ] = XDTO_ТЧ;
    КонецЕсли;
	
	КонтейнерXDTO[ИмяТипаЭлементаXDTO] = ЭлементКонтейнераXDTO;  
	
	Возврат КонтейнерXDTO;

КонецФункции

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Процедура ОтправитьСообщениеЗапрос(ПараметрыСообщения)
	
	ПараметрыОтправки = Новый Структура();
	// - xdto-пакет
	ПараметрыОтправки.Вставить("ИмяПакетаXDTO"		 , "tn_Integration_Portal");	
	ПараметрыОтправки.Вставить("ИмяТипаОтветногоXDTO", "requestSetOff");
		
	// - транспорт (RabbitMQ)
	УИДПортала = Новый УникальныйИдентификатор("8859a021-d63f-11ea-b819-00155d4d7383");
	ПроизводственноеПодразделениеПортал = Справочники.тн_ПроизводственныеПодразделения.ПолучитьСсылку(УИДПортала);
	ПараметрыОтправки.Вставить("Профиль"			 		  , Справочники.тн_ПрофилиПодключений.ERP_УХ);
	ПараметрыОтправки.Вставить("ФорматСообщения"	 		  , "JSON");
	ПараметрыОтправки.Вставить("ТочкаОбменаRabbitMQ" 		  , Справочники.ТочкиОбменаRMQ.ТекущаяБаза);
	ПараметрыОтправки.Вставить("КлючМаршрутизации"	 		  , XMLСтрока(ПроизводственноеПодразделениеПортал));
    ПараметрыОтправки.Вставить("ПроизводственноеПодразделение", ПроизводственноеПодразделениеПортал);
    ПараметрыОтправки.Вставить("КонтейнерXDTO"				  , ПараметрыСообщения.КонтейнерXDTO);

	// - логирование
	ДанныеДляЛогирования = тн_ИнтеграцияFinAppPortal.ДанныеДляЛогирования(
		ПараметрыСообщения.ВидСообщения,,, ПараметрыОтправки.Профиль.ВестиЛоги, Перечисления.тн_ВидыИнтеграций.Портал_Отправка);
	ПараметрыОтправки.Вставить("ДанныеДляЛогирования", ДанныеДляЛогирования); 
	
	Попытка
		тн_ИнтеграцияFinAppPortal.ОтправитьПакет(ПараметрыСообщения.ТекстСообщения, ПараметрыОтправки); 
		тн_ИнтеграцияFinAppPortal.ЗаписатьЛогРаботы("Ответ", ПараметрыОтправки.ДанныеДляЛогирования, ПараметрыСообщения.ТекстСообщения, Перечисления.тн_ВидыСобытийИнтеграции.ОтправленПакет);
	Исключение 
		ОписаниеОшибки = "Ошибка выгрузки в Портал: " + ПараметрыОтправки.ИмяТипаОтветногоXDTO + " - " + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
		тн_ИнтеграцияFinAppPortal.ЗаписатьЛогРаботы("Ошибка", ПараметрыОтправки.ДанныеДляЛогирования, ОписаниеОшибки);
		ВызватьИсключение ОписаниеОшибки;
	КонецПопытки; 
	
КонецПроцедуры

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Процедура ДобавитьЗаписьЗапросыRabbitMQ(ПараметрыЗаписи) 
	
	РегистрыСведений.тн_ЗапросыRabbitMQ.ДобавитьЗаписьПриОтправкеСообщения(ПараметрыЗаписи);	
	
КонецПроцедуры

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Функция ДлительнаяОперацияОжиданияОбработкиОтветногоСообщения(ПараметрыСообщения, УникальныйИдентификатор, РегламентноеЗадание = Ложь)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.Вставить("ИдентификаторЗапроса", ПараметрыСообщения.ИдентификаторЗапроса); 
	ПараметрыВыполнения.Вставить("ВидСообщения", ПараметрыСообщения.ВидСообщения);
	ПараметрыВыполнения.Вставить("ВремяОжиданияОтветаСекунд", ПараметрыСообщения.ВремяОжиданияОтветаСекунд);

	Если РегламентноеЗадание Тогда
		ПараметрыВыполнения.ОжидатьЗавершение = 5 + ПараметрыСообщения.ВремяОжиданияОтветаСекунд;
	КонецЕсли;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "тн_ИнтеграцияFinAppPortal.РезультатЗапросаДанныхСПортала", ПараметрыВыполнения); 
	
КонецФункции

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
//
Функция ПараметрыСообщения() 
	
	ПараметрыСообщения = Новый Структура("ИдентификаторЗапроса, ВидСообщения, КонтейнерXDTO, ТекстСообщения, ВремяОжиданияОтветаСекунд"); 
	
	ПараметрыСообщения.ИдентификаторЗапроса 	 = Строка(Новый УникальныйИдентификатор());
	ПараметрыСообщения.ВидСообщения 		     = Перечисления.тн_ВидыСообщенийPortal.requestSetOff; 
	ПараметрыСообщения.КонтейнерXDTO             = Неопределено; 
	ПараметрыСообщения.ТекстСообщения 		     = "";
	ПараметрыСообщения.ВремяОжиданияОтветаСекунд = тн_ИнтеграцияRMQ.ВремяОжиданияОтветаОтЗапросыRabbitMQ();
	
	Возврат ПараметрыСообщения;
	
КонецФункции  

#КонецОбласти

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
#КонецОбласти    

// Юдина Екатерина 06.10.2025 Выполнение задач №000055378 
#КонецЕсли
